MM/app/controllers/offers_controller.rb

  def show
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @offer = Offer.new(params[:offer])
    if @offer.save
---
INSERT INTO "offers" ("created_at", "ride_slot_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 03 May 2012 03:33:43 UTC +00:00], ["ride_slot_id", 3], ["updated_at", Thu, 03 May 2012 03:33:43 UTC +00:00], ["user_id", 1]]