app/controllers/slots_controller.rb

  def index
    @slots = Slot.all
---
SELECT "slots".* FROM "slots"

  def show
    @slot = Slot.find(params[:id])
---
SELECT "slots".* FROM "slots" WHERE "slots"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @slot = Slot.new(params[:slot])
    if @slot.save
---
INSERT INTO "slots" ("created_at", "from_datetime", "from_flexible", "from_loc_str", "number_of_seats", "price", "ride_slot_id", "to_datetime", "to_flexible", "to_loc_str", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)