app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    # block! see user_sessions_controller.rb for description
    @user.save do |result|
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)